In [7]:
 import pandas as pd
import numpy as np

In [8]:
l1=[1,2,3,5,8,7]

In [10]:
ser=pd.Series(l1)
print (ser)

0    1
1    2
2    3
3    5
4    8
5    7
dtype: int64

In [11]:
ser.values

array([1, 2, 3, 5, 8, 7], dtype=int64)

In [12]:
ser.index

RangeIndex(start=0, stop=6, step=1)

In [ ]:
#sr = pd.Series(data, index = index_list)

In [13]:
l2=['a','b','c','d','e','f']

In [14]:
ser1 = pd.Series(l1, index=l2)
print(ser1)

a    1
b    2
c    3
d    5
e    8
f    7
dtype: int64

In [15]:
ser.loc[0]

1

In [ ]:
#ser.iloc [] for intiger location.

In [16]:
ser.iloc[2]

3

In [18]:
ser1.loc['b']

2

In [ ]:
# task
#raw 1-4 [1:4]

In [19]:
# creating empty dataframe
df= pd.DataFrame()

In [20]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [21]:
df['pawan'] =[22,1,54,62,41]

In [22]:
df

   pawan
0     22
1      1
2     54
3     62
4     41

In [31]:
df['a']=[54,56,58,26,np.nan]

In [32]:
df

   pawan     a
0     22  54.0
1      1  56.0
2     54  58.0
3     62  26.0
4     41   NaN

In [46]:
df.loc[5]=[41,42]

In [47]:
df

   key1  key2
a  val1  val3
b  val2  val4
5    41    42

In [33]:
# accessing a raw
df.loc[2]

pawan    54.0
a        58.0
Name: 2, dtype: float64

In [34]:
# accessing a colum
df['pawan']

0    22
1     1
2    54
3    62
4    41
Name: pawan, dtype: int64

In [ ]:
df.

In [36]:
# accessing specific colum of a specific raw
#3rd raw of pawan
df['pawan'].iloc[2]

54

In [37]:
df['pawan'].sum()

180

In [38]:
# creating a data frame using a dictionary
dict1={'key1':['val1','val2'],'key2':['val3','val4']}
print(dict1)

{'key1': ['val1', 'val2'], 'key2': ['val3', 'val4']}

In [39]:
df=pd.DataFrame(dict1)
print(df)

   key1  key2
0  val1  val3
1  val2  val4

In [53]:
df2=pd.DataFrame(dict1,index=['a','b'])
print(df2)

   key1  key2
a  val1  val3
b  val2  val4

In [54]:
#task
# make a dic. with employee data colum name(name, age, add., qualification) which is having 10 datapoints
# change the default index to abcd...
# add nuw colum name designation
# add new raw of a new data of employee

In [ ]:
# to access file from pc
#pd.read_csv('file name')
#data=pd.read_excel('demo.xlsx')

In [5]:
data=pd.read_excel('ML.DATA.xlsx')

In [55]:
# for colum delet *axis=1
# for raw *axis=0
df2= df2.drop(['key2'], axis=1)

In [56]:
df2

   key1
a  val1
b  val2

In [61]:
df2=df2.drop(['a'], axis=0)

In [63]:
df2

   key1
b  val2

In [ ]:
#subtatting of dataframe

#df[['a','b','c']].loc[['a','b']]  or [['b:c']]

In [ ]:
# next lec.

In [10]:
df=pd.read_excel('ML.DATA1.xlsx')

In [11]:
df

   SR.NO  BLOOD SUGER LEVEL DIABETES
0      1                190       NO
1      2                130      YES
2      3                140      YES
3      4                160       NO
4      5                175       NO
5      6                190       NO
6      7                200      YES
7      8                215      YES
8      9                240       NO
9     10                320      YES

In [14]:
df= df.drop(['SR.NO'], axis=1)

In [15]:
df

   BLOOD SUGER LEVEL DIABETES
0                190       NO
1                130      YES
2                140      YES
3                160       NO
4                175       NO
5                190       NO
6                200      YES
7                215      YES
8                240       NO
9                320      YES

In [16]:
#10raw two colum
df.shape

(10, 2)

In [17]:
df.head()

   BLOOD SUGER LEVEL DIABETES
0                190       NO
1                130      YES
2                140      YES
3                160       NO
4                175       NO

In [18]:
df.head(3)

   BLOOD SUGER LEVEL DIABETES
0                190       NO
1                130      YES
2                140      YES

In [19]:
df.tail()

   BLOOD SUGER LEVEL DIABETES
5                190       NO
6                200      YES
7                215      YES
8                240       NO
9                320      YES

In [20]:
df.tail(4)

   BLOOD SUGER LEVEL DIABETES
6                200      YES
7                215      YES
8                240       NO
9                320      YES

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   SR.NO   4 non-null      int64
 1   NAME    4 non-null      object
 2   AGE     4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [22]:
#returns statistical summary of all numeric colums in the dataframe
df.describe()

       BLOOD SUGER LEVEL
count          10.000000
mean          196.000000
std            54.762112
min           130.000000
25%           163.750000
50%           190.000000
75%           211.250000
max           320.000000

In [24]:
df.isnull()

   BLOOD SUGER LEVEL  DIABETES
0              False     False
1              False     False
2              False     False
3              False     False
4              False     False
5              False     False
6              False     False
7              False     False
8              False     False
9              False     False

In [25]:
df.isnull().sum()

BLOOD SUGER LEVEL    0
DIABETES             0
dtype: int64

In [26]:
df.notnull()

   BLOOD SUGER LEVEL  DIABETES
0               True      True
1               True      True
2               True      True
3               True      True
4               True      True
5               True      True
6               True      True
7               True      True
8               True      True
9               True      True

In [27]:
df.notnull().sum()

BLOOD SUGER LEVEL    10
DIABETES             10
dtype: int64

In [28]:
df['BLOOD SUGER LEVEL'].mean()

196.0

In [29]:
df['BLOOD SUGER LEVEL'].max()

320

In [30]:
df['BLOOD SUGER LEVEL'].sum()

1960

In [32]:
df['DIABETES'].mode()

0     NO
1    YES
dtype: object

In [33]:
df['DIABETES'].value_counts()

NO     5
YES    5
Name: DIABETES, dtype: int64

In [34]:
#to fill the null values in the colums
df['DIABETES'].fillna('YES')

0     NO
1    YES
2    YES
3     NO
4     NO
5     NO
6    YES
7    YES
8     NO
9    YES
Name: DIABETES, dtype: object

In [35]:
df['BLOOD SUGER LEVEL'].fillna('130')

0    190
1    130
2    140
3    160
4    175
5    190
6    200
7    215
8    240
9    320
Name: BLOOD SUGER LEVEL, dtype: int64

In [ ]:
#task
#make a dataframe student coume1-mathes marks out of 50 , colum2-science marks out of 50 , for 10 data-4 missing in math, 3 missing in science
#inpute the missing value by mean of the colum
# make a 3rd colum grade avrage which is avg. of math and science
# make a 4th colum grade if marks is greater than 50 grade A else grade B

In [41]:
df1= df[df['BLOOD SUGER LEVEL']<160]

In [42]:
df1

   BLOOD SUGER LEVEL DIABETES
1                130      YES
2                140      YES

In [43]:
df.dropna()

   BLOOD SUGER LEVEL DIABETES
0                190       NO
1                130      YES
2                140      YES
3                160       NO
4                175       NO
5                190       NO
6                200      YES
7                215      YES
8                240       NO
9                320      YES

In [44]:
df.groupby(by=['DIABETES'])['BLOOD SUGER LEVEL'].mean()

DIABETES
NO     191.0
YES    201.0
Name: BLOOD SUGER LEVEL, dtype: float64

In [ ]:
#w3schools python